РазрешенияНаБСП24/src/DataProcessors/ПолучениеОтчетаДляТаможни/ПолучениеОтчетаДляТаможни.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПолучениеОтчетаДляТаможни</name>
  <attributes>
    <name>ДатаВывоза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разрешение</name>
    <type>
      <types>DocumentRef.Разрешения</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

РазрешенияНаБСП24/src/Documents/Разрешения/Разрешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Разрешения</name>
  <registerRecords>AccumulationRegister.ОстаткиПоКвоте</registerRecords>
  <attributes>
    <name>SenderCRO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverLAB</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ПринимающаяЛаборатория</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegisatrationLetterNr</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Valid</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrialPermit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StudyNumber</name>
    <type>
      <types>CatalogRef.Протоколы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ambient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Frozen</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Chilled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Requesters</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредупреждения</name>
    <type>
      <types>EnumRef.ТипыПредупреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ClearanceДепо</name>
    <type>
      <types>EnumRef.ClearanceДепо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписант</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Города</name>
    <attributes>
      <name>Город</name>
      <type>
        <types>CatalogRef.Города</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образцы</name>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.Образцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбразца</name>
      <type>
        <types>EnumRef.ТипыОбразцов</types>
      </type>
    </attributes>
    <attributes>
      <name>Квота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НулевойОстаток</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазрешенияНаБСП24/src/Documents/Накладные/Накладные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Накладные</name>
  <registerRecords>AccumulationRegister.ОстаткиПоКвоте</registerRecords>
  <attributes>
    <name>ДатаВывоза</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородПикапа</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разрешения</name>
    <attributes>
      <name>Разрешение</name>
      <type>
        <types>DocumentRef.Разрешения</types>
      </type>
    </attributes>
    <attributes>
      <name>PermitNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образцы</name>
    <attributes>
      <name>Разрешение</name>
      <type>
        <types>DocumentRef.Разрешения</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.Образцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбразца</name>
      <type>
        <types>EnumRef.ТипыОбразцов</types>
      </type>
    </attributes>
    <attributes>
      <name>Списание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазрешенияНаБСП24/src/DataProcessors/ПолучениеОтчетаДляТаможни/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьНаСервере(Разрешение)
Отчет = Отчеты.ОтчетДляТаможниНаДату1.Создать();
	
Схема               = Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;  
КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
ПроцессорВывода     = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;    
ТабДок              = Новый ТабличныйДокумент;




ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема); 
КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);

Настройки   = Схема.НастройкиПоУмолчанию;
насРазрешение = Настройки.ПараметрыДанных.Элементы.Найти("Разрешение"); 
насРазрешение.Использование = Истина;
насРазрешение.Значение = Разрешение; 

насПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
насПериод.Использование = Истина;
НасПериод.Значение = Объект.ДатаВывоза;

Макет       = КомпоновщикМакета.Выполнить(Схема, Настройки);    
ПроцессорКомпоновки.Инициализировать(Макет,,,Истина); 
ПроцессорВывода.УстановитьДокумент(ТабДок); 
ПроцессорВывода.Вывести(ПроцессорКомпоновки);

Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура Получить(Команда)
	Если Объект.Разрешение = Документы.Разрешения.ПустаяСсылка() тогда
	МассивРазрешений = ПолучитьРазрешения();
	
	Для Каждого Разрешение из МассивРазрешений Цикл
	ТабДок = Новый ТабличныйДокумент;
	Табдок = ПолучитьНаСервере(Разрешение);
	Табдок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Табдок.АвтоМасштаб = Истина;
	
	Область = ТабДок.НайтиТекст("Параметры");
	Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ТабДок.УдалитьОбласть(Область, Смещать);
	
    Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ТабДок.УдалитьОбласть(ТабДок.Область("R3C2"),Смещать);

    ТекстЗаголовка = "Лист исполнения к Разрешению МЗ РФ № "+Разрешение.Номер+ " от " + Формат(Разрешение.Issued,"ДФ=dd.MM.yyyy");
	//ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1; 
	//ТабДок.НижнийКолонтитул.Выводить             = Истина;
	//ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1; 
	//ТабДок.НижнийКолонтитул.Выводить             = Истина;
	//ТабДок.РазмерКолонтитулаСнизу                 = 12;
	//ТабДок.ПолеСверху                             = 10;
	//ТабДок.ПолеСнизу                             = 20;
	//ТабДок.ПолеСправа                            = 10;
	//ТабДок.ПолеСлева                            =10;
	//ТабДок.НижнийКолонтитул.ТекстСлева        = "Подпись_____________________";
	Область.Текст = ТекстЗаголовка;
	
	Область = ТабДок.ПолучитьОбласть("R4C1");
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	ТабДок.УдалитьОбласть(ТабДок.Область("R5C1:R12C2"),Смещать);
    НоваяОбласть = Новый ТабличныйДокумент;
	Секция = НоваяОбласть.ПолучитьОбласть("R1C3");
	Секция.Область("R1C3").Текст = "Подпись ___________";
	//Секция.Область("R1C3").Шрифт.Размер = 12;
	Табдок.Присоединить(Секция,,,);
	//Табдок.Показать();
	Табдок.Напечатать();
	 //Возврат
 КонецЦикла;
 
Иначе 
	
	
	
	ТабДок = Новый ТабличныйДокумент;
	Табдок = ПолучитьНаСервере(Объект.Разрешение);
	Табдок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Табдок.АвтоМасштаб = Истина;
	
	Область = ТабДок.НайтиТекст("Параметры");
	Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ТабДок.УдалитьОбласть(Область, Смещать);
	
	Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ТабДок.УдалитьОбласть(ТабДок.Область("R3C2"),Смещать);

	
    ТекстЗаголовка = "Лист исполнения к Разрешению МЗ РФ № "+Объект.Разрешение.Номер+ " от " + Формат(Объект.Разрешение.issued,"ДФ=dd.MM.yyyy");
	//ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1; 
	//ТабДок.НижнийКолонтитул.Выводить             = Истина;
	//ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1; 
	//ТабДок.НижнийКолонтитул.Выводить             = Истина;
	//ТабДок.РазмерКолонтитулаСнизу                 = 12;
	//ТабДок.ПолеСверху                             = 10;
	//ТабДок.ПолеСнизу                             = 20;
	//ТабДок.ПолеСправа                            = 10;
	//ТабДок.ПолеСлева                            =10;
	//ТабДок.НижнийКолонтитул.ТекстСлева        = "Подпись_____________________";
	Область.Текст = ТекстЗаголовка;
	
	Область = ТабДок.ПолучитьОбласть("R4C1");
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	ТабДок.УдалитьОбласть(ТабДок.Область("R5C1:R12C2"),Смещать);
    НоваяОбласть = Новый ТабличныйДокумент;
	Секция = НоваяОбласть.ПолучитьОбласть("R1C3");
	Секция.Область("R1C3").Текст = "Подпись ___________";
	//Секция.Область("R1C3").Шрифт.Размер = 12;
	Табдок.Присоединить(Секция,,,);
	//Табдок.Показать();
	Табдок.Напечатать();
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ПолучитьРазрешения();

Запрос = Новый Запрос;

Запрос.УстановитьПараметр("ДатаВывоза", НачалоДня(Объект.ДатаВывоза));

Запрос.Текст =  "ВЫБРАТЬ
                |	НакладныеОбразцы.Разрешение
                |ИЗ
                |	Документ.Накладные.Образцы КАК НакладныеОбразцы
                |ГДЕ
                |	НакладныеОбразцы.Ссылка.ДатаВывоза = &ДатаВывоза
                |
                |СГРУППИРОВАТЬ ПО
                |	НакладныеОбразцы.Разрешение" ;
				
Выгрузка = Запрос.Выполнить().Выгрузить();

Возврат Выгрузка.ВыгрузитьКолонку("Разрешение");

	
КонецФункции
